FreeRTOS/FreeRTOS/FreeRTOS/Demo/Common/drivers/ST/STM32F10xFWLib/inc/stm32fxxx_eth.h
/*----------------------------------------------------------------------------*/
/*                          DMA descriptors types                             */
/*----------------------------------------------------------------------------*/
/* ETHERNET DMA Desciptors data structure definition  */
typedef struct
{
    volatile u32 Status;                /* Status */
    volatile u32 ControlBufferSize;     /* Control and Buffer1, Buffer2 lengths */
    volatile u32 Buffer1Addr;           /* Buffer1 address pointer */
    volatile u32 Buffer2NextDescAddr;   /* Buffer2 or next descriptor address pointer */
} ETH_DMADESCTypeDef;

/* Exported constants --------------------------------------------------------*/

/*----------------------------------------------------------------------------*/
/*                         ETHERNET Frames defines                            */
/*----------------------------------------------------------------------------*/
/* ENET Buffers setting */
#define ETH_MAX_PACKET_SIZE    1520    /* ETH_HEADER + ETH_EXTRA + MAX_ETH_PAYLOAD + ETH_CRC */
#define ETH_HEADER             14      /* 6 byte Dest addr, 6 byte Src addr, 2 byte length/type */
#define ETH_CRC                4       /* Ethernet CRC */
#define ETH_EXTRA              2       /* Extra bytes in some cases */
#define VLAN_TAG               4       /* optional 802.1q VLAN Tag */
#define MIN_ETH_PAYLOAD        46      /* Minimum Ethernet payload size */
#define MAX_ETH_PAYLOAD        1500    /* Maximum Ethernet payload size */
#define JUMBO_FRAME_PAYLOAD    9000    /* Jumbo frame payload size */

/*--------------------------------------------------------*/
/*   Ethernet DMA descriptors registers bits definition   */
/*--------------------------------------------------------*/
/* DMA Tx Desciptor ---------------------------------------------------------*/

/*-----------------------------------------------------------------------------------------------
 * TDES0 | OWN(31) | CTRL[30:26] | Reserved[25:24] | CTRL[23:20] | Reserved[19:17] | Status[16:0] |                                         |
 * -----------------------------------------------------------------------------------------------
 * TDES1 | Reserved[31:29] | Buffer2 ByteCount[28:16] | Reserved[15:13] | Buffer1 ByteCount[12:0] |
 * -----------------------------------------------------------------------------------------------
 * TDES2 |                         Buffer1 Address [31:0]                                         |
 * -----------------------------------------------------------------------------------------------
 * TDES3 |                   Buffer2 Address [31:0] / Next Desciptor Address [31:0]               |
 * ----------------------------------------------------------------------------------------------*/

/* Bit definition of TDES0 register: DMA Tx descriptor status register */
#define ETH_DMATxDesc_OWN                       ( 0x80000000UL )       /* OWN bit: descriptor is owned by DMA engine */
#define ETH_DMATxDesc_IC                        ( ( u32 ) 0x40000000 ) /* Interrupt on Completion */
#define ETH_DMATxDesc_LS                        ( ( u32 ) 0x20000000 ) /* Last Segment */
#define ETH_DMATxDesc_FS                        ( ( u32 ) 0x10000000 ) /* First Segment */
#define ETH_DMATxDesc_DC                        ( ( u32 ) 0x08000000 ) /* Disable CRC */
#define ETH_DMATxDesc_DP                        ( ( u32 ) 0x04000000 ) /* Disable Padding */
#define ETH_DMATxDesc_TTSE                      ( ( u32 ) 0x02000000 ) /* Transmit Time Stamp Enable */
#define ETH_DMATxDesc_CIC                       ( ( u32 ) 0x00C00000 ) /* Checksum Insertion Control: 4 cases */
#define ETH_DMATxDesc_CIC_ByPass                ( ( u32 ) 0x00000000 ) /* Do Nothing: Checksum Engine is bypassed */
#define ETH_DMATxDesc_CIC_IPV4Header            ( ( u32 ) 0x00400000 ) /* IPV4 header Checksum Insertion */
#define ETH_DMATxDesc_CIC_TCPUDPICMP_Segment    ( ( u32 ) 0x00800000 ) /* TCP/UDP/ICMP Checksum Insertion calculated over segment only */
#define ETH_DMATxDesc_CIC_TCPUDPICMP_Full       ( ( u32 ) 0x00C00000 ) /* TCP/UDP/ICMP Checksum Insertion fully calculated */
#define ETH_DMATxDesc_TER                       ( ( u32 ) 0x00200000 ) /* Transmit End of Ring */
#define ETH_DMATxDesc_TCH                       ( ( u32 ) 0x00100000 ) /* Second Address Chained */
#define ETH_DMATxDesc_TTSS                      ( ( u32 ) 0x00020000 ) /* Tx Time Stamp Status */
#define ETH_DMATxDesc_IHE                       ( ( u32 ) 0x00010000 ) /* IP Header Error */
#define ETH_DMATxDesc_ES                        ( ( u32 ) 0x00008000 ) /* Error summary: OR of the following bits: UE || ED || EC || LCO || NC || LCA || FF || JT */
#define ETH_DMATxDesc_JT                        ( ( u32 ) 0x00004000 ) /* Jabber Timeout */
#define ETH_DMATxDesc_FF                        ( ( u32 ) 0x00002000 ) /* Frame Flushed: DMA/MTL flushed the frame due to SW flush */
#define ETH_DMATxDesc_PCE                       ( ( u32 ) 0x00001000 ) /* Payload Checksum Error */
#define ETH_DMATxDesc_LCA                       ( ( u32 ) 0x00000800 ) /* Loss of Carrier: carrier lost during tramsmission */
#define ETH_DMATxDesc_NC                        ( ( u32 ) 0x00000400 ) /* No Carrier: no carrier signal from the tranceiver */
#define ETH_DMATxDesc_LCO                       ( ( u32 ) 0x00000200 ) /* Late Collision: transmission aborted due to collision */
#define ETH_DMATxDesc_EC                        ( ( u32 ) 0x00000100 ) /* Excessive Collision: transmission aborted after 16 collisions */
#define ETH_DMATxDesc_VF                        ( ( u32 ) 0x00000080 ) /* VLAN Frame */
#define ETH_DMATxDesc_CC                        ( ( u32 ) 0x00000078 ) /* Collision Count */
#define ETH_DMATxDesc_ED                        ( ( u32 ) 0x00000004 ) /* Excessive Deferral */
#define ETH_DMATxDesc_UF                        ( ( u32 ) 0x00000002 ) /* Underflow Error: late data arrival from the memory */
#define ETH_DMATxDesc_DB                        ( ( u32 ) 0x00000001 ) /* Deferred Bit */

/* Bit definition of TDES1 register */
#define ETH_DMATxDesc_TBS2                      ( ( u32 ) 0x1FFF0000 ) /* Transmit Buffer2 Size */
#define ETH_DMATxDesc_TBS1                      ( ( u32 ) 0x00001FFF ) /* Transmit Buffer1 Size */

