FreeRTOS/FreeRTOS/FreeRTOS/Demo/Common/drivers/ST/STM32F10xFWLib/inc/stm32fxxx_eth.h
/* Bit definition of TDES2 register */
#define ETH_DMATxDesc_B1AP                      ( ( u32 ) 0xFFFFFFFF ) /* Buffer1 Address Pointer */

/* Bit definition of TDES3 register */
#define ETH_DMATxDesc_B2AP                      ( ( u32 ) 0xFFFFFFFF ) /* Buffer2 Address Pointer */

/* DMA Rx descriptor ---------------------------------------------------------*/

/*---------------------------------------------------------------------------------------------------------------------
 * RDES0 | OWN(31) |                                             Status [30:0]                                          |
 * ---------------------------------------------------------------------------------------------------------------------
 * RDES1 | CTRL(31) | Reserved[30:29] | Buffer2 ByteCount[28:16] | CTRL[15:14] | Reserved(13) | Buffer1 ByteCount[12:0] |
 * ---------------------------------------------------------------------------------------------------------------------
 * RDES2 |                                       Buffer1 Address [31:0]                                                 |
 * ---------------------------------------------------------------------------------------------------------------------
 * RDES3 |                          Buffer2 Address [31:0] / Next Desciptor Address [31:0]                              |
 * --------------------------------------------------------------------------------------------------------------------*/

/* Bit definition of RDES0 register: DMA Rx descriptor status register */
#define ETH_DMARxDesc_OWN            ( ( u32 ) 0x80000000 ) /* OWN bit: descriptor is owned by DMA engine  */
#define ETH_DMARxDesc_AFM            ( ( u32 ) 0x40000000 ) /* DA Filter Fail for the rx frame  */
#define ETH_DMARxDesc_FL             ( ( u32 ) 0x3FFF0000 ) /* Receive descriptor frame length  */
#define ETH_DMARxDesc_ES             ( ( u32 ) 0x00008000 ) /* Error summary: OR of the following bits: DE || OE || IPC || LC || RWT || RE || CE */
#define ETH_DMARxDesc_DE             ( ( u32 ) 0x00004000 ) /* Desciptor error: no more descriptors for receive frame  */
#define ETH_DMARxDesc_SAF            ( ( u32 ) 0x00002000 ) /* SA Filter Fail for the received frame */
#define ETH_DMARxDesc_LE             ( ( u32 ) 0x00001000 ) /* Frame size not matching with length field */
#define ETH_DMARxDesc_OE             ( ( u32 ) 0x00000800 ) /* Overflow Error: Frame was damaged due to buffer overflow */
#define ETH_DMARxDesc_VLAN           ( ( u32 ) 0x00000400 ) /* VLAN Tag: received frame is a VLAN frame */
#define ETH_DMARxDesc_FS             ( ( u32 ) 0x00000200 ) /* First descriptor of the frame  */
#define ETH_DMARxDesc_LS             ( ( u32 ) 0x00000100 ) /* Last descriptor of the frame  */
#define ETH_DMARxDesc_IPV4HCE        ( ( u32 ) 0x00000080 ) /* IPC Checksum Error/Giant Frame: Rx Ipv4 header checksum error   */
#define ETH_DMARxDesc_RxLongFrame    ( ( u32 ) 0x00000080 ) /* (Giant Frame)Rx - frame is longer than 1518/1522   */
#define ETH_DMARxDesc_LC             ( ( u32 ) 0x00000040 ) /* Late collision occurred during reception   */
#define ETH_DMARxDesc_FT             ( ( u32 ) 0x00000020 ) /* Frame type - Ethernet, otherwise 802.3    */
#define ETH_DMARxDesc_RWT            ( ( u32 ) 0x00000010 ) /* Receive Watchdog Timeout: watchdog timer expired during reception    */
#define ETH_DMARxDesc_RE             ( ( u32 ) 0x00000008 ) /* Receive error: error reported by MII interface  */
#define ETH_DMARxDesc_DBE            ( ( u32 ) 0x00000004 ) /* Dribble bit error: frame contains non int multiple of 8 bits  */
#define ETH_DMARxDesc_CE             ( ( u32 ) 0x00000002 ) /* CRC error */
#define ETH_DMARxDesc_MAMPCE         ( ( u32 ) 0x00000001 ) /* Rx MAC Address/Payload Checksum Error: Rx MAC address matched/ Rx Payload Checksum Error */

/* Bit definition of RDES1 register */
#define ETH_DMARxDesc_DIC            ( ( u32 ) 0x80000000 ) /* Disable Interrupt on Completion */
#define ETH_DMARxDesc_RBS2           ( ( u32 ) 0x1FFF0000 ) /* Receive Buffer2 Size */
#define ETH_DMARxDesc_RER            ( ( u32 ) 0x00008000 ) /* Receive End of Ring */
#define ETH_DMARxDesc_RCH            ( ( u32 ) 0x00004000 ) /* Second Address Chained */
#define ETH_DMARxDesc_RBS1           ( ( u32 ) 0x00001FFF ) /* Receive Buffer1 Size */

/* Bit definition of RDES2 register */
#define ETH_DMARxDesc_B1AP           ( ( u32 ) 0xFFFFFFFF ) /* Buffer1 Address Pointer */

/* Bit definition of RDES3 register */
#define ETH_DMARxDesc_B2AP           ( ( u32 ) 0xFFFFFFFF ) /* Buffer2 Address Pointer */

/*----------------------------------------------------------------------------*/
/*                   Desciption of common PHY registers                      */
/*----------------------------------------------------------------------------*/
/* PHY Read/write Timeouts */
#define PHY_READ_TO                    ( ( u32 ) 0x0004FFFF )
#define PHY_WRITE_TO                   ( ( u32 ) 0x0004FFFF )

/* PHY Reset Delay */
#define PHY_ResetDelay                 ( ( u32 ) 0x000FFFFF )

/* PHY Config Delay */
#define PHY_ConfigDelay                ( ( u32 ) 0x00FFFFFF )

/* PHY Register address */
#define PHY_BCR                        0            /* Tranceiver Basic Control Register */
#define PHY_BSR                        1            /* Tranceiver Basic Status Register */

/* PHY basic Control register */
#define PHY_Reset                      ( ( u16 ) 0x8000 )  /* PHY Reset */
#define PHY_Loopback                   ( ( u16 ) 0x4000 )  /* Select loop-back mode */
#define PHY_FULLDUPLEX_100M            ( ( u16 ) 0x2100 )  /* Set the full-duplex mode at 100 Mb/s */
#define PHY_HALFDUPLEX_100M            ( ( u16 ) 0x2000 )  /* Set the half-duplex mode at 100 Mb/s */
#define PHY_FULLDUPLEX_10M             ( ( u16 ) 0x0100 )  /* Set the full-duplex mode at 10 Mb/s */
#define PHY_HALFDUPLEX_10M             ( ( u16 ) 0x0000 )  /* Set the half-duplex mode at 10 Mb/s */
#define PHY_AutoNegotiation            ( ( u16 ) 0x1000 )  /* Enable auto-negotiation function */
#define PHY_Restart_AutoNegotiation    ( ( u16 ) 0x0200 )  /* Restart auto-negotiation function */
#define PHY_Powerdown                  ( ( u16 ) 0x0800 )  /* Select the power down mode */
#define PHY_Isolate                    ( ( u16 ) 0x0400 )  /* Isolate PHY from MII */

