FreeRTOS/FreeRTOS/FreeRTOS/Demo/Common/drivers/ST/STM32F10xFWLib/inc/stm32fxxx_eth.h
/* PHY basic status register */
#define PHY_AutoNego_Complete          ( ( u16 ) 0x0020 )  /* Auto-Negotioation process completed */
#define PHY_Linked_Status              ( ( u16 ) 0x0004 )  /* Valid link established */
#define PHY_Jabber_detection           ( ( u16 ) 0x0002 )  /* Jabber condition detected */

/* The PHY status register value change from a PHY to another so the user have to update
 * this value depending on the used external PHY */
/* For LAN8700 */
/*#define PHY_SR                           31         / * Tranceiver Status Register * / */
/* For DP83848 */
#define PHY_SR    16                             /* Tranceiver Status Register */

/* PHY status register */

/* The Speed and Duplex mask values change from a PHY to another so the user have to update
 * this value depending on the used external PHY */
/* For LAN8700 */
/*#define PHY_Speed_Status            ((u16)0x0004)       / * Configured information of Speed: 10Mbps * / */
/*#define PHY_Duplex_Status           ((u16)0x0010)       / * Configured information of Duplex: Full-duplex * / */
/* For DP83848 */
#define PHY_Speed_Status     ( ( u16 ) 0x0002 )      /* Configured information of Speed: 10Mbps */
#define PHY_Duplex_Status    ( ( u16 ) 0x0004 )      /* Configured information of Duplex: Full-duplex */

#define IS_ETH_PHY_ADDRESS( ADDRESS )    ( ( ADDRESS ) <= 0x20 )
#define IS_ETH_PHY_REG( REG )   \
    ( ( ( REG ) == PHY_BCR ) || \
      ( ( REG ) == PHY_BSR ) || \
      ( ( REG ) == PHY_SR ) )

/*----------------------------------------------------------------------------*/
/*                                 MAC defines                                */
/*----------------------------------------------------------------------------*/
/* ETHERNET AutoNegotiation --------------------------------------------------*/
#define ETH_AutoNegotiation_Enable     ( ( u32 ) 0x00000001 )
#define ETH_AutoNegotiation_Disable    ( ( u32 ) 0x00000000 )

#define IS_ETH_AUTONEGOTIATION( CMD )              \
    ( ( ( CMD ) == ETH_AutoNegotiation_Enable ) || \
      ( ( CMD ) == ETH_AutoNegotiation_Disable ) )

/* ETHERNET watchdog ---------------------------------------------------------*/
#define ETH_Watchdog_Enable     ( ( u32 ) 0x00000000 )
#define ETH_Watchdog_Disable    ( ( u32 ) 0x00800000 )

#define IS_ETH_WATCHDOG( CMD )              \
    ( ( ( CMD ) == ETH_Watchdog_Enable ) || \
      ( ( CMD ) == ETH_Watchdog_Disable ) )

/* ETHERNET Jabber -----------------------------------------------------------*/
#define ETH_Jabber_Enable     ( ( u32 ) 0x00000000 )
#define ETH_Jabber_Disable    ( ( u32 ) 0x00400000 )

#define IS_ETH_JABBER( CMD )              \
    ( ( ( CMD ) == ETH_Jabber_Enable ) || \
      ( ( CMD ) == ETH_Jabber_Disable ) )

/* ETHERNET Jumbo Frame ------------------------------------------------------*/
#define ETH_JumboFrame_Enable     ( ( u32 ) 0x00100000 )
#define ETH_JumboFrame_Disable    ( ( u32 ) 0x00000000 )

#define IS_ETH_JUMBO_FRAME( CMD )             \
    ( ( ( CMD ) == ETH_JumboFrame_Enable ) || \
      ( ( CMD ) == ETH_JumboFrame_Disable ) )

/* ETHERNET Inter Frame Gap --------------------------------------------------*/
#define ETH_InterFrameGap_96Bit    ( ( u32 ) 0x00000000 ) /* minimum IFG between frames during transmission is 96Bit */
#define ETH_InterFrameGap_88Bit    ( ( u32 ) 0x00020000 ) /* minimum IFG between frames during transmission is 88Bit */
#define ETH_InterFrameGap_80Bit    ( ( u32 ) 0x00040000 ) /* minimum IFG between frames during transmission is 80Bit */
#define ETH_InterFrameGap_72Bit    ( ( u32 ) 0x00060000 ) /* minimum IFG between frames during transmission is 72Bit */
#define ETH_InterFrameGap_64Bit    ( ( u32 ) 0x00080000 ) /* minimum IFG between frames during transmission is 64Bit */
#define ETH_InterFrameGap_56Bit    ( ( u32 ) 0x000A0000 ) /* minimum IFG between frames during transmission is 56Bit */
#define ETH_InterFrameGap_48Bit    ( ( u32 ) 0x000C0000 ) /* minimum IFG between frames during transmission is 48Bit */
#define ETH_InterFrameGap_40Bit    ( ( u32 ) 0x000E0000 ) /* minimum IFG between frames during transmission is 40Bit */

#define IS_ETH_INTER_FRAME_GAP( GAP )           \
    ( ( ( GAP ) == ETH_InterFrameGap_96Bit ) || \
      ( ( GAP ) == ETH_InterFrameGap_88Bit ) || \
      ( ( GAP ) == ETH_InterFrameGap_80Bit ) || \
      ( ( GAP ) == ETH_InterFrameGap_72Bit ) || \
      ( ( GAP ) == ETH_InterFrameGap_64Bit ) || \
      ( ( GAP ) == ETH_InterFrameGap_56Bit ) || \
      ( ( GAP ) == ETH_InterFrameGap_48Bit ) || \
      ( ( GAP ) == ETH_InterFrameGap_40Bit ) )

/* ETHERNET Carrier Sense ----------------------------------------------------*/
#define ETH_CarrierSense_Enable     ( ( u32 ) 0x00000000 )
#define ETH_CarrierSense_Disable    ( ( u32 ) 0x00010000 )

#define IS_ETH_CARRIER_SENSE( CMD )             \
    ( ( ( CMD ) == ETH_CarrierSense_Enable ) || \
      ( ( CMD ) == ETH_CarrierSense_Disable ) )

/* ETHERNET Speed ------------------------------------------------------------*/
#define ETH_Speed_10M     ( ( u32 ) 0x00000000 )
#define ETH_Speed_100M    ( ( u32 ) 0x00004000 )

#define IS_ETH_SPEED( SPEED )           \
    ( ( ( SPEED ) == ETH_Speed_10M ) || \
      ( ( SPEED ) == ETH_Speed_100M ) )

/* ETHERNET Receive Own ------------------------------------------------------*/
#define ETH_ReceiveOwn_Enable     ( ( u32 ) 0x00000000 )
#define ETH_ReceiveOwn_Disable    ( ( u32 ) 0x00002000 )

#define IS_ETH_RECEIVE_OWN( CMD )             \
    ( ( ( CMD ) == ETH_ReceiveOwn_Enable ) || \
      ( ( CMD ) == ETH_ReceiveOwn_Disable ) )

/* ETHERNET Loop back Mode ---------------------------------------------------*/
#define ETH_LoopbackMode_Enable     ( ( u32 ) 0x00001000 )
#define ETH_LoopbackMode_Disable    ( ( u32 ) 0x00000000 )

#define IS_ETH_LOOPBACK_MODE( CMD )             \
    ( ( ( CMD ) == ETH_LoopbackMode_Enable ) || \
      ( ( CMD ) == ETH_LoopbackMode_Disable ) )

/* ETHERNET Duplex mode ------------------------------------------------------*/
#define ETH_Mode_FullDuplex    ( ( u32 ) 0x00000800 )
#define ETH_Mode_HalfDuplex    ( ( u32 ) 0x00000000 )

#define IS_ETH_DUPLEX_MODE( MODE )           \
    ( ( ( MODE ) == ETH_Mode_FullDuplex ) || \
      ( ( MODE ) == ETH_Mode_HalfDuplex ) )

/* ETHERNET Checksum Offload -------------------------------------------------*/
#define ETH_ChecksumOffload_Enable     ( ( u32 ) 0x00000400 )
#define ETH_ChecksumOffload_Disable    ( ( u32 ) 0x00000000 )

#define IS_ETH_CHECKSUM_OFFLOAD( CMD )             \
    ( ( ( CMD ) == ETH_ChecksumOffload_Enable ) || \
      ( ( CMD ) == ETH_ChecksumOffload_Disable ) )

/* ETHERNET Retry Transmission -----------------------------------------------*/
#define ETH_RetryTransmission_Enable     ( ( u32 ) 0x00000000 )
#define ETH_RetryTransmission_Disable    ( ( u32 ) 0x00000200 )

