FreeRTOS/FreeRTOS/FreeRTOS/Demo/Common/drivers/ST/STM32F10xFWLib/inc/stm32fxxx_eth.h
#define IS_ETH_RETRY_TRANSMISSION( CMD )             \
    ( ( ( CMD ) == ETH_RetryTransmission_Enable ) || \
      ( ( CMD ) == ETH_RetryTransmission_Disable ) )

/* ETHERNET Automatic Pad/CRC Strip ------------------------------------------*/
#define ETH_AutomaticPadCRCStrip_Enable     ( ( u32 ) 0x00000080 )
#define ETH_AutomaticPadCRCStrip_Disable    ( ( u32 ) 0x00000000 )

#define IS_ETH_AUTOMATIC_PADCRC_STRIP( CMD )            \
    ( ( ( CMD ) == ETH_AutomaticPadCRCStrip_Enable ) || \
      ( ( CMD ) == ETH_AutomaticPadCRCStrip_Disable ) )

/* ETHERNET Back-Off limit ---------------------------------------------------*/
#define ETH_BackOffLimit_10    ( ( u32 ) 0x00000000 )
#define ETH_BackOffLimit_8     ( ( u32 ) 0x00000020 )
#define ETH_BackOffLimit_4     ( ( u32 ) 0x00000040 )
#define ETH_BackOffLimit_1     ( ( u32 ) 0x00000060 )

#define IS_ETH_BACKOFF_LIMIT( LIMIT )         \
    ( ( ( LIMIT ) == ETH_BackOffLimit_10 ) || \
      ( ( LIMIT ) == ETH_BackOffLimit_8 ) ||  \
      ( ( LIMIT ) == ETH_BackOffLimit_4 ) ||  \
      ( ( LIMIT ) == ETH_BackOffLimit_1 ) )

/* ETHERNET Deferral Check ---------------------------------------------------*/
#define ETH_DeferralCheck_Enable     ( ( u32 ) 0x00000010 )
#define ETH_DeferralCheck_Disable    ( ( u32 ) 0x00000000 )

#define IS_ETH_DEFERRAL_CHECK( CMD )             \
    ( ( ( CMD ) == ETH_DeferralCheck_Enable ) || \
      ( ( CMD ) == ETH_DeferralCheck_Disable ) )

/* ETHERNET Receive All ------------------------------------------------------*/
#define ETH_ReceiveAll_Enable     ( ( u32 ) 0x80000000 )
#define ETH_ReceiveAll_Disable    ( ( u32 ) 0x00000000 )

#define IS_ETH_RECEIVE_ALL( CMD )             \
    ( ( ( CMD ) == ETH_ReceiveAll_Enable ) || \
      ( ( CMD ) == ETH_ReceiveAll_Disable ) )

/* ETHERNET Source Addr Filter ------------------------------------------------*/
#define ETH_SourceAddrFilter_Normal_Enable     ( ( u32 ) 0x00000200 )
#define ETH_SourceAddrFilter_Inverse_Enable    ( ( u32 ) 0x00000300 )
#define ETH_SourceAddrFilter_Disable           ( ( u32 ) 0x00000000 )

#define IS_ETH_SOURCE_ADDR_FILTER( CMD )                    \
    ( ( ( CMD ) == ETH_SourceAddrFilter_Normal_Enable ) ||  \
      ( ( CMD ) == ETH_SourceAddrFilter_Inverse_Enable ) || \
      ( ( CMD ) == ETH_SourceAddrFilter_Disable ) )

/* ETHERNET Pass Control Frames ----------------------------------------------*/
#define ETH_PassControlFrames_BlockAll                   ( ( u32 ) 0x00000040 ) /* MAC filters all control frames from reaching the application */
#define ETH_PassControlFrames_ForwardAll                 ( ( u32 ) 0x00000080 ) /* MAC forwards all control frames to application even if they fail the Address Filter */
#define ETH_PassControlFrames_ForwardPassedAddrFilter    ( ( u32 ) 0x000000C0 ) /* MAC forwards control frames that pass the Address Filter. */

#define IS_ETH_CONTROL_FRAMES( PASS )                     \
    ( ( ( PASS ) == ETH_PassControlFrames_BlockAll ) ||   \
      ( ( PASS ) == ETH_PassControlFrames_ForwardAll ) || \
      ( ( PASS ) == ETH_PassControlFrames_ForwardPassedAddrFilter ) )

/* ETHERNET Broadcast Frames Reception ---------------------------------------*/
#define ETH_BroadcastFramesReception_Enable     ( ( u32 ) 0x00000000 )
#define ETH_BroadcastFramesReception_Disable    ( ( u32 ) 0x00000020 )

#define IS_ETH_BROADCAST_FRAMES_RECEPTION( CMD )            \
    ( ( ( CMD ) == ETH_BroadcastFramesReception_Enable ) || \
      ( ( CMD ) == ETH_BroadcastFramesReception_Disable ) )

/* ETHERNET Destination Addr Filter ------------------------------------------*/
#define ETH_DestinationAddrFilter_Normal     ( ( u32 ) 0x00000000 )
#define ETH_DestinationAddrFilter_Inverse    ( ( u32 ) 0x00000008 )

#define IS_ETH_DESTINATION_ADDR_FILTER( FILTER )            \
    ( ( ( FILTER ) == ETH_DestinationAddrFilter_Normal ) || \
      ( ( FILTER ) == ETH_DestinationAddrFilter_Inverse ) )

/* ETHERNET Promiscuous Mode -------------------------------------------------*/
#define ETH_PromiscuousMode_Enable     ( ( u32 ) 0x00000001 )
#define ETH_PromiscuousMode_Disable    ( ( u32 ) 0x00000000 )

#define IS_ETH_PROMISCUOUS_MODE( CMD )             \
    ( ( ( CMD ) == ETH_PromiscuousMode_Enable ) || \
      ( ( CMD ) == ETH_PromiscuousMode_Disable ) )

/* ETHERNET multicast frames filter --------------------------------------------*/
#define ETH_MulticastFramesFilter_PerfectHashTable    ( ( u32 ) 0x00000404 )
#define ETH_MulticastFramesFilter_HashTable           ( ( u32 ) 0x00000004 )
#define ETH_MulticastFramesFilter_Perfect             ( ( u32 ) 0x00000000 )
#define ETH_MulticastFramesFilter_None                ( ( u32 ) 0x00000010 )

#define IS_ETH_MULTICAST_FRAMES_FILTER( FILTER )                      \
    ( ( ( FILTER ) == ETH_MulticastFramesFilter_PerfectHashTable ) || \
      ( ( FILTER ) == ETH_MulticastFramesFilter_HashTable ) ||        \
      ( ( FILTER ) == ETH_MulticastFramesFilter_Perfect ) ||          \
      ( ( FILTER ) == ETH_MulticastFramesFilter_None ) )

/* ETHERNET unicast frames filter --------------------------------------------*/
#define ETH_UnicastFramesFilter_PerfectHashTable    ( ( u32 ) 0x00000402 )
#define ETH_UnicastFramesFilter_HashTable           ( ( u32 ) 0x00000002 )
#define ETH_UnicastFramesFilter_Perfect             ( ( u32 ) 0x00000000 )

#define IS_ETH_UNICAST_FRAMES_FILTER( FILTER )                      \
    ( ( ( FILTER ) == ETH_UnicastFramesFilter_PerfectHashTable ) || \
      ( ( FILTER ) == ETH_UnicastFramesFilter_HashTable ) ||        \
      ( ( FILTER ) == ETH_UnicastFramesFilter_Perfect ) )

/* ETHERNET Pause Time ------------------------------------------------*/
#define IS_ETH_PAUSE_TIME( TIME )    ( ( TIME ) <= 0xFFFF )

/* ETHERNET Zero Quanta Pause ------------------------------------------------*/
#define ETH_ZeroQuantaPause_Enable     ( ( u32 ) 0x00000000 )
#define ETH_ZeroQuantaPause_Disable    ( ( u32 ) 0x00000080 )

#define IS_ETH_ZEROQUANTA_PAUSE( CMD )             \
    ( ( ( CMD ) == ETH_ZeroQuantaPause_Enable ) || \
      ( ( CMD ) == ETH_ZeroQuantaPause_Disable ) )

/* ETHERNET Pause Low Threshold ----------------------------------------------*/
#define ETH_PauseLowThreshold_Minus4      ( ( u32 ) 0x00000000 ) /* Pause time minus 4 slot times */
#define ETH_PauseLowThreshold_Minus28     ( ( u32 ) 0x00000010 ) /* Pause time minus 28 slot times */
#define ETH_PauseLowThreshold_Minus144    ( ( u32 ) 0x00000020 ) /* Pause time minus 144 slot times */
#define ETH_PauseLowThreshold_Minus256    ( ( u32 ) 0x00000030 ) /* Pause time minus 256 slot times */

#define IS_ETH_PAUSE_LOW_THRESHOLD( THRESHOLD )              \
    ( ( ( THRESHOLD ) == ETH_PauseLowThreshold_Minus4 ) ||   \
      ( ( THRESHOLD ) == ETH_PauseLowThreshold_Minus28 ) ||  \
      ( ( THRESHOLD ) == ETH_PauseLowThreshold_Minus144 ) || \
      ( ( THRESHOLD ) == ETH_PauseLowThreshold_Minus256 ) )

/* ETHERNET Unicast Pause Frame Detect ---------------------------------------*/
#define ETH_UnicastPauseFrameDetect_Enable     ( ( u32 ) 0x00000008 )
#define ETH_UnicastPauseFrameDetect_Disable    ( ( u32 ) 0x00000000 )

#define IS_ETH_UNICAST_PAUSE_FRAME_DETECT( CMD )           \
    ( ( ( CMD ) == ETH_UnicastPauseFrameDetect_Enable ) || \
      ( ( CMD ) == ETH_UnicastPauseFrameDetect_Disable ) )

/* ETHERNET Receive Flow Control ---------------------------------------------*/
#define ETH_ReceiveFlowControl_Enable     ( ( u32 ) 0x00000004 )
#define ETH_ReceiveFlowControl_Disable    ( ( u32 ) 0x00000000 )

