FreeRTOS/FreeRTOS/FreeRTOS/Demo/Common/drivers/ST/STM32F10xFWLib/inc/stm32fxxx_eth.h
#define IS_ETH_RECEIVE_FLOWCONTROL( CMD )             \
    ( ( ( CMD ) == ETH_ReceiveFlowControl_Enable ) || \
      ( ( CMD ) == ETH_ReceiveFlowControl_Disable ) )

/* ETHERNET Transmit Flow Control --------------------------------------------*/
#define ETH_TransmitFlowControl_Enable     ( ( u32 ) 0x00000002 )
#define ETH_TransmitFlowControl_Disable    ( ( u32 ) 0x00000000 )

#define IS_ETH_TRANSMIT_FLOWCONTROL( CMD )             \
    ( ( ( CMD ) == ETH_TransmitFlowControl_Enable ) || \
      ( ( CMD ) == ETH_TransmitFlowControl_Disable ) )

/* ETHERNET VLAN Tag Comparison ----------------------------------------------*/
#define ETH_VLANTagComparison_12Bit    ( ( u32 ) 0x00010000 )
#define ETH_VLANTagComparison_16Bit    ( ( u32 ) 0x00000000 )

#define IS_ETH_VLAN_TAG_COMPARISON( COMPARISON )           \
    ( ( ( COMPARISON ) == ETH_VLANTagComparison_12Bit ) || \
      ( ( COMPARISON ) == ETH_VLANTagComparison_16Bit ) )

#define IS_ETH_VLAN_TAG_IDENTIFIER( IDENTIFIER )    ( ( IDENTIFIER ) <= 0xFFFF )

/* ETHERNET MAC Flags ---------------------------------------------------*/
#define ETH_MAC_FLAG_TST     ( ( u32 ) 0x00000200 ) /* Time stamp trigger flag (on MAC) */
#define ETH_MAC_FLAG_MMCT    ( ( u32 ) 0x00000040 ) /* MMC transmit flag  */
#define ETH_MAC_FLAG_MMCR    ( ( u32 ) 0x00000020 ) /* MMC receive flag */
#define ETH_MAC_FLAG_MMC     ( ( u32 ) 0x00000010 ) /* MMC flag (on MAC) */
#define ETH_MAC_FLAG_PMT     ( ( u32 ) 0x00000008 ) /* PMT flag (on MAC) */

#define IS_ETH_MAC_GET_FLAG( FLAG )                                            \
    ( ( ( FLAG ) == ETH_MAC_FLAG_TST ) || ( ( FLAG ) == ETH_MAC_FLAG_MMCT ) || \
      ( ( FLAG ) == ETH_MAC_FLAG_MMCR ) || ( ( FLAG ) == ETH_MAC_FLAG_MMC ) || \
      ( ( FLAG ) == ETH_MAC_FLAG_PMT ) )

/* ETHERNET MAC Interrupts ---------------------------------------------------*/
#define ETH_MAC_IT_TST     ( ( u32 ) 0x00000200 ) /* Time stamp trigger interrupt (on MAC) */
#define ETH_MAC_IT_MMCT    ( ( u32 ) 0x00000040 ) /* MMC transmit interrupt */
#define ETH_MAC_IT_MMCR    ( ( u32 ) 0x00000020 ) /* MMC receive interrupt */
#define ETH_MAC_IT_MMC     ( ( u32 ) 0x00000010 ) /* MMC interrupt (on MAC) */
#define ETH_MAC_IT_PMT     ( ( u32 ) 0x00000008 ) /* PMT interrupt (on MAC) */

#define IS_ETH_MAC_IT( IT )    ( ( ( ( IT ) &( u32 ) 0xFFFFFDF7 ) == 0x00 ) && ( ( IT ) != 0x00 ) )
#define IS_ETH_MAC_GET_IT( IT )                                        \
    ( ( ( IT ) == ETH_MAC_IT_TST ) || ( ( IT ) == ETH_MAC_IT_MMCT ) || \
      ( ( IT ) == ETH_MAC_IT_MMCR ) || ( ( IT ) == ETH_MAC_IT_MMC ) || \
      ( ( IT ) == ETH_MAC_IT_PMT ) )

/* ETHERNET MAC addresses ----------------------------------------------------*/
#define ETH_MAC_Address0    ( ( u32 ) 0x00000000 )
#define ETH_MAC_Address1    ( ( u32 ) 0x00000008 )
#define ETH_MAC_Address2    ( ( u32 ) 0x00000010 )
#define ETH_MAC_Address3    ( ( u32 ) 0x00000018 )

#define IS_ETH_MAC_ADDRESS0123( ADDRESS )    \
    ( ( ( ADDRESS ) == ETH_MAC_Address0 ) || \
      ( ( ADDRESS ) == ETH_MAC_Address1 ) || \
      ( ( ADDRESS ) == ETH_MAC_Address2 ) || \
      ( ( ADDRESS ) == ETH_MAC_Address3 ) )

#define IS_ETH_MAC_ADDRESS123( ADDRESS )     \
    ( ( ( ADDRESS ) == ETH_MAC_Address1 ) || \
      ( ( ADDRESS ) == ETH_MAC_Address2 ) || \
      ( ( ADDRESS ) == ETH_MAC_Address3 ) )

/* ETHERNET MAC addresses filter: SA/DA filed of received frames ------------*/
#define ETH_MAC_AddressFilter_SA    ( ( u32 ) 0x00000000 )
#define ETH_MAC_AddressFilter_DA    ( ( u32 ) 0x00000008 )

#define IS_ETH_MAC_ADDRESS_FILTER( FILTER )         \
    ( ( ( FILTER ) == ETH_MAC_AddressFilter_SA ) || \
      ( ( FILTER ) == ETH_MAC_AddressFilter_DA ) )

/* ETHERNET MAC addresses filter: Mask bytes ---------------------------------*/
#define ETH_MAC_AddressMask_Byte6    ( ( u32 ) 0x20000000 ) /* Mask MAC Address high reg bits [15:8] */
#define ETH_MAC_AddressMask_Byte5    ( ( u32 ) 0x10000000 ) /* Mask MAC Address high reg bits [7:0] */
#define ETH_MAC_AddressMask_Byte4    ( ( u32 ) 0x08000000 ) /* Mask MAC Address low reg bits [31:24] */
#define ETH_MAC_AddressMask_Byte3    ( ( u32 ) 0x04000000 ) /* Mask MAC Address low reg bits [23:16] */
#define ETH_MAC_AddressMask_Byte2    ( ( u32 ) 0x02000000 ) /* Mask MAC Address low reg bits [15:8] */
#define ETH_MAC_AddressMask_Byte1    ( ( u32 ) 0x01000000 ) /* Mask MAC Address low reg bits [70] */

#define IS_ETH_MAC_ADDRESS_MASK( MASK )            \
    ( ( ( MASK ) == ETH_MAC_AddressMask_Byte6 ) || \
      ( ( MASK ) == ETH_MAC_AddressMask_Byte5 ) || \
      ( ( MASK ) == ETH_MAC_AddressMask_Byte4 ) || \
      ( ( MASK ) == ETH_MAC_AddressMask_Byte3 ) || \
      ( ( MASK ) == ETH_MAC_AddressMask_Byte2 ) || \
      ( ( MASK ) == ETH_MAC_AddressMask_Byte1 ) )

/*----------------------------------------------------------------------------*/
/*                     Ethernet DMA Desciptors defines                       */
/*----------------------------------------------------------------------------*/
/* ETHERNET DMA Tx descriptor flags  --------------------------------------------------------*/
#define IS_ETH_DMATxDESC_GET_FLAG( FLAG )   \
    ( ( ( FLAG ) == ETH_DMATxDesc_OWN ) ||  \
      ( ( FLAG ) == ETH_DMATxDesc_IC ) ||   \
      ( ( FLAG ) == ETH_DMATxDesc_LS ) ||   \
      ( ( FLAG ) == ETH_DMATxDesc_FS ) ||   \
      ( ( FLAG ) == ETH_DMATxDesc_DC ) ||   \
      ( ( FLAG ) == ETH_DMATxDesc_DP ) ||   \
      ( ( FLAG ) == ETH_DMATxDesc_TTSE ) || \
      ( ( FLAG ) == ETH_DMATxDesc_TER ) ||  \
      ( ( FLAG ) == ETH_DMATxDesc_TCH ) ||  \
      ( ( FLAG ) == ETH_DMATxDesc_TTSS ) || \
      ( ( FLAG ) == ETH_DMATxDesc_IHE ) ||  \
      ( ( FLAG ) == ETH_DMATxDesc_ES ) ||   \
      ( ( FLAG ) == ETH_DMATxDesc_JT ) ||   \
      ( ( FLAG ) == ETH_DMATxDesc_FF ) ||   \
      ( ( FLAG ) == ETH_DMATxDesc_PCE ) ||  \
      ( ( FLAG ) == ETH_DMATxDesc_LCA ) ||  \
      ( ( FLAG ) == ETH_DMATxDesc_NC ) ||   \
      ( ( FLAG ) == ETH_DMATxDesc_LCO ) ||  \
      ( ( FLAG ) == ETH_DMATxDesc_EC ) ||   \
      ( ( FLAG ) == ETH_DMATxDesc_VF ) ||   \
      ( ( FLAG ) == ETH_DMATxDesc_CC ) ||   \
      ( ( FLAG ) == ETH_DMATxDesc_ED ) ||   \
      ( ( FLAG ) == ETH_DMATxDesc_UF ) ||   \
      ( ( FLAG ) == ETH_DMATxDesc_DB ) )

/* ETHERNET DMA Tx descriptor segment ----------------------------------------*/
#define ETH_DMATxDesc_LastSegment     ( ( u32 ) 0x40000000 ) /* Last Segment */
#define ETH_DMATxDesc_FirstSegment    ( ( u32 ) 0x20000000 ) /* First Segment */

#define IS_ETH_DMA_TXDESC_SEGMENT( SEGMENT )          \
    ( ( ( SEGMENT ) == ETH_DMATxDesc_LastSegment ) || \
      ( ( SEGMENT ) == ETH_DMATxDesc_FirstSegment ) )

/* ETHERNET DMA Tx descriptor Checksum Insertion Control  --------------------*/
#define ETH_DMATxDesc_ChecksumByPass               ( ( u32 ) 0x00000000 ) /* Checksum engine bypass */
#define ETH_DMATxDesc_ChecksumIPV4Header           ( ( u32 ) 0x00400000 ) /* IPv4 header checksum insertion  */
#define ETH_DMATxDesc_ChecksumTCPUDPICMPSegment    ( ( u32 ) 0x00800000 ) /* TCP/UDP/ICMP checksum insertion. Pseudo header checksum is assumed to be present */
#define ETH_DMATxDesc_ChecksumTCPUDPICMPFull       ( ( u32 ) 0x00C00000 ) /* TCP/UDP/ICMP checksum fully in hardware including pseudo header */

#define IS_ETH_DMA_TXDESC_CHECKSUM( CHECKSUM )                       \
    ( ( ( CHECKSUM ) == ETH_DMATxDesc_ChecksumByPass ) ||            \
      ( ( CHECKSUM ) == ETH_DMATxDesc_ChecksumIPV4Header ) ||        \
      ( ( CHECKSUM ) == ETH_DMATxDesc_ChecksumTCPUDPICMPSegment ) || \
      ( ( CHECKSUM ) == ETH_DMATxDesc_ChecksumTCPUDPICMPFull ) )

/* ETHERNET DMA Tx Desciptor buffer size */
#define IS_ETH_DMATxDESC_BUFFER_SIZE( SIZE )    ( ( SIZE ) <= 0x1FFF )

