FreeRTOS/FreeRTOS/FreeRTOS/Demo/Common/drivers/ST/STM32F10xFWLib/inc/stm32fxxx_eth.h
/* ETHERNET DMA Rx descriptor flags  --------------------------------------------------------*/
#define IS_ETH_DMARxDESC_GET_FLAG( FLAG )          \
    ( ( ( FLAG ) == ETH_DMARxDesc_OWN ) ||         \
      ( ( FLAG ) == ETH_DMARxDesc_AFM ) ||         \
      ( ( FLAG ) == ETH_DMARxDesc_ES ) ||          \
      ( ( FLAG ) == ETH_DMARxDesc_DE ) ||          \
      ( ( FLAG ) == ETH_DMARxDesc_SAF ) ||         \
      ( ( FLAG ) == ETH_DMARxDesc_LE ) ||          \
      ( ( FLAG ) == ETH_DMARxDesc_OE ) ||          \
      ( ( FLAG ) == ETH_DMARxDesc_VLAN ) ||        \
      ( ( FLAG ) == ETH_DMARxDesc_FS ) ||          \
      ( ( FLAG ) == ETH_DMARxDesc_LS ) ||          \
      ( ( FLAG ) == ETH_DMARxDesc_IPV4HCE ) ||     \
      ( ( FLAG ) == ETH_DMARxDesc_RxLongFrame ) || \
      ( ( FLAG ) == ETH_DMARxDesc_LC ) ||          \
      ( ( FLAG ) == ETH_DMARxDesc_FT ) ||          \
      ( ( FLAG ) == ETH_DMARxDesc_RWT ) ||         \
      ( ( FLAG ) == ETH_DMARxDesc_RE ) ||          \
      ( ( FLAG ) == ETH_DMARxDesc_DBE ) ||         \
      ( ( FLAG ) == ETH_DMARxDesc_CE ) ||          \
      ( ( FLAG ) == ETH_DMARxDesc_MAMPCE ) )

/* ETHERNET DMA Rx descriptor buffers  ---------------------------------------*/
#define ETH_DMARxDesc_Buffer1    ( ( u32 ) 0x00000000 ) /* DMA Rx Desc Buffer1 */
#define ETH_DMARxDesc_Buffer2    ( ( u32 ) 0x00000001 ) /* DMA Rx Desc Buffer2 */

#define IS_ETH_DMA_RXDESC_BUFFER( BUFFER )       \
    ( ( ( BUFFER ) == ETH_DMARxDesc_Buffer1 ) || \
      ( ( BUFFER ) == ETH_DMARxDesc_Buffer2 ) )

/*----------------------------------------------------------------------------*/
/*                          Ethernet DMA defines                              */
/*----------------------------------------------------------------------------*/
/* ETHERNET Drop TCP/IP Checksum Error Frame ---------------------------------*/
#define ETH_DropTCPIPChecksumErrorFrame_Enable     ( ( u32 ) 0x00000000 )
#define ETH_DropTCPIPChecksumErrorFrame_Disable    ( ( u32 ) 0x04000000 )

#define IS_ETH_DROP_TCPIP_CHECKSUM_FRAME( CMD )                \
    ( ( ( CMD ) == ETH_DropTCPIPChecksumErrorFrame_Enable ) || \
      ( ( CMD ) == ETH_DropTCPIPChecksumErrorFrame_Disable ) )

/* ETHERNET Receive Store Forward --------------------------------------------*/
#define ETH_ReceiveStoreForward_Enable     ( ( u32 ) 0x02000000 )
#define ETH_ReceiveStoreForward_Disable    ( ( u32 ) 0x00000000 )

#define IS_ETH_RECEIVE_STORE_FORWARD( CMD )            \
    ( ( ( CMD ) == ETH_ReceiveStoreForward_Enable ) || \
      ( ( CMD ) == ETH_ReceiveStoreForward_Disable ) )

/* ETHERNET Flush Received Frame ---------------------------------------------*/
#define ETH_FlushReceivedFrame_Enable     ( ( u32 ) 0x00000000 )
#define ETH_FlushReceivedFrame_Disable    ( ( u32 ) 0x01000000 )

#define IS_ETH_FLUSH_RECEIVE_FRAME( CMD )             \
    ( ( ( CMD ) == ETH_FlushReceivedFrame_Enable ) || \
      ( ( CMD ) == ETH_FlushReceivedFrame_Disable ) )

/* ETHERNET Transmit Store Forward -------------------------------------------*/
#define ETH_TransmitStoreForward_Enable     ( ( u32 ) 0x00200000 )
#define ETH_TransmitStoreForward_Disable    ( ( u32 ) 0x00000000 )

#define IS_ETH_TRANSMIT_STORE_FORWARD( CMD )            \
    ( ( ( CMD ) == ETH_TransmitStoreForward_Enable ) || \
      ( ( CMD ) == ETH_TransmitStoreForward_Disable ) )

/* ETHERNET Transmit Threshold Control ---------------------------------------*/
#define ETH_TransmitThresholdControl_64Bytes     ( ( u32 ) 0x00000000 ) /* threshold level of the MTL Transmit FIFO is 64 Bytes */
#define ETH_TransmitThresholdControl_128Bytes    ( ( u32 ) 0x00004000 ) /* threshold level of the MTL Transmit FIFO is 128 Bytes */
#define ETH_TransmitThresholdControl_192Bytes    ( ( u32 ) 0x00008000 ) /* threshold level of the MTL Transmit FIFO is 192 Bytes */
#define ETH_TransmitThresholdControl_256Bytes    ( ( u32 ) 0x0000C000 ) /* threshold level of the MTL Transmit FIFO is 256 Bytes */
#define ETH_TransmitThresholdControl_40Bytes     ( ( u32 ) 0x00010000 ) /* threshold level of the MTL Transmit FIFO is 40 Bytes */
#define ETH_TransmitThresholdControl_32Bytes     ( ( u32 ) 0x00014000 ) /* threshold level of the MTL Transmit FIFO is 32 Bytes */
#define ETH_TransmitThresholdControl_24Bytes     ( ( u32 ) 0x00018000 ) /* threshold level of the MTL Transmit FIFO is 24 Bytes */
#define ETH_TransmitThresholdControl_16Bytes     ( ( u32 ) 0x0001C000 ) /* threshold level of the MTL Transmit FIFO is 16 Bytes */

#define IS_ETH_TRANSMIT_THRESHOLD_CONTROL( THRESHOLD )              \
    ( ( ( THRESHOLD ) == ETH_TransmitThresholdControl_64Bytes ) ||  \
      ( ( THRESHOLD ) == ETH_TransmitThresholdControl_128Bytes ) || \
      ( ( THRESHOLD ) == ETH_TransmitThresholdControl_192Bytes ) || \
      ( ( THRESHOLD ) == ETH_TransmitThresholdControl_256Bytes ) || \
      ( ( THRESHOLD ) == ETH_TransmitThresholdControl_40Bytes ) ||  \
      ( ( THRESHOLD ) == ETH_TransmitThresholdControl_32Bytes ) ||  \
      ( ( THRESHOLD ) == ETH_TransmitThresholdControl_24Bytes ) ||  \
      ( ( THRESHOLD ) == ETH_TransmitThresholdControl_16Bytes ) )

/* ETHERNET Forward Error Frames ---------------------------------------------*/
#define ETH_ForwardErrorFrames_Enable     ( ( u32 ) 0x00000080 )
#define ETH_ForwardErrorFrames_Disable    ( ( u32 ) 0x00000000 )

#define IS_ETH_FORWARD_ERROR_FRAMES( CMD )            \
    ( ( ( CMD ) == ETH_ForwardErrorFrames_Enable ) || \
      ( ( CMD ) == ETH_ForwardErrorFrames_Disable ) )

/* ETHERNET Forward Undersized Good Frames -----------------------------------*/
#define ETH_ForwardUndersizedGoodFrames_Enable     ( ( u32 ) 0x00000040 )
#define ETH_ForwardUndersizedGoodFrames_Disable    ( ( u32 ) 0x00000000 )

#define IS_ETH_FORWARD_UNDERSIZED_GOOD_FRAMES( CMD )           \
    ( ( ( CMD ) == ETH_ForwardUndersizedGoodFrames_Enable ) || \
      ( ( CMD ) == ETH_ForwardUndersizedGoodFrames_Disable ) )

/* ETHERNET Receive Threshold Control ----------------------------------------*/
#define ETH_ReceiveThresholdControl_64Bytes     ( ( u32 ) 0x00000000 ) /* threshold level of the MTL Receive FIFO is 64 Bytes */
#define ETH_ReceiveThresholdControl_32Bytes     ( ( u32 ) 0x00000008 ) /* threshold level of the MTL Receive FIFO is 32 Bytes */
#define ETH_ReceiveThresholdControl_96Bytes     ( ( u32 ) 0x00000010 ) /* threshold level of the MTL Receive FIFO is 96 Bytes */
#define ETH_ReceiveThresholdControl_128Bytes    ( ( u32 ) 0x00000018 ) /* threshold level of the MTL Receive FIFO is 128 Bytes */

