FreeRTOS/FreeRTOS/FreeRTOS/Demo/Common/drivers/ST/STM32F10xFWLib/inc/stm32fxxx_eth.h
#define IS_ETH_RECEIVE_THRESHOLD_CONTROL( THRESHOLD )             \
    ( ( ( THRESHOLD ) == ETH_ReceiveThresholdControl_64Bytes ) || \
      ( ( THRESHOLD ) == ETH_ReceiveThresholdControl_32Bytes ) || \
      ( ( THRESHOLD ) == ETH_ReceiveThresholdControl_96Bytes ) || \
      ( ( THRESHOLD ) == ETH_ReceiveThresholdControl_128Bytes ) )

/* ETHERNET Second Frame Operate ---------------------------------------------*/
#define ETH_SecondFrameOperate_Enable     ( ( u32 ) 0x00000004 )
#define ETH_SecondFrameOperate_Disable    ( ( u32 ) 0x00000000 )

#define IS_ETH_SECOND_FRAME_OPERATE( CMD )            \
    ( ( ( CMD ) == ETH_SecondFrameOperate_Enable ) || \
      ( ( CMD ) == ETH_SecondFrameOperate_Disable ) )

/* ETHERNET Address Aligned Beats --------------------------------------------*/
#define ETH_AddressAlignedBeats_Enable     ( ( u32 ) 0x02000000 )
#define ETH_AddressAlignedBeats_Disable    ( ( u32 ) 0x00000000 )

#define IS_ETH_ADDRESS_ALIGNED_BEATS( CMD )            \
    ( ( ( CMD ) == ETH_AddressAlignedBeats_Enable ) || \
      ( ( CMD ) == ETH_AddressAlignedBeats_Disable ) )

/* ETHERNET Fixed Burst ------------------------------------------------------*/
#define ETH_FixedBurst_Enable     ( ( u32 ) 0x00010000 )
#define ETH_FixedBurst_Disable    ( ( u32 ) 0x00000000 )

#define IS_ETH_FIXED_BURST( CMD )             \
    ( ( ( CMD ) == ETH_FixedBurst_Enable ) || \
      ( ( CMD ) == ETH_FixedBurst_Disable ) )

/* ETHERNET Rx DMA Burst Length ----------------------------------------------*/
#define ETH_RxDMABurstLength_1Beat            ( ( u32 ) 0x00020000 ) /* maximum number of beats to be transferred in one RxDMA transaction is 1 */
#define ETH_RxDMABurstLength_2Beat            ( ( u32 ) 0x00040000 ) /* maximum number of beats to be transferred in one RxDMA transaction is 2 */
#define ETH_RxDMABurstLength_4Beat            ( ( u32 ) 0x00080000 ) /* maximum number of beats to be transferred in one RxDMA transaction is 4 */
#define ETH_RxDMABurstLength_8Beat            ( ( u32 ) 0x00100000 ) /* maximum number of beats to be transferred in one RxDMA transaction is 8 */
#define ETH_RxDMABurstLength_16Beat           ( ( u32 ) 0x00200000 ) /* maximum number of beats to be transferred in one RxDMA transaction is 16 */
#define ETH_RxDMABurstLength_32Beat           ( ( u32 ) 0x00400000 ) /* maximum number of beats to be transferred in one RxDMA transaction is 32 */

#define ETH_RxDMABurstLength_4xPBL_4Beat      ( ( u32 ) 0x01020000 ) /* maximum number of beats to be transferred in one RxDMA transaction is 4 */
#define ETH_RxDMABurstLength_4xPBL_8Beat      ( ( u32 ) 0x01040000 ) /* maximum number of beats to be transferred in one RxDMA transaction is 8 */
#define ETH_RxDMABurstLength_4xPBL_16Beat     ( ( u32 ) 0x01080000 ) /* maximum number of beats to be transferred in one RxDMA transaction is 16 */
#define ETH_RxDMABurstLength_4xPBL_32Beat     ( ( u32 ) 0x01100000 ) /* maximum number of beats to be transferred in one RxDMA transaction is 32 */
#define ETH_RxDMABurstLength_4xPBL_64Beat     ( ( u32 ) 0x01200000 ) /* maximum number of beats to be transferred in one RxDMA transaction is 64 */
#define ETH_RxDMABurstLength_4xPBL_128Beat    ( ( u32 ) 0x01400000 ) /* maximum number of beats to be transferred in one RxDMA transaction is 128 */

#define IS_ETH_RXDMA_BURST_LENGTH( LENGTH )                  \
    ( ( ( LENGTH ) == ETH_RxDMABurstLength_1Beat ) ||        \
      ( ( LENGTH ) == ETH_RxDMABurstLength_2Beat ) ||        \
      ( ( LENGTH ) == ETH_RxDMABurstLength_4Beat ) ||        \
      ( ( LENGTH ) == ETH_RxDMABurstLength_8Beat ) ||        \
      ( ( LENGTH ) == ETH_RxDMABurstLength_16Beat ) ||       \
      ( ( LENGTH ) == ETH_RxDMABurstLength_32Beat ) ||       \
      ( ( LENGTH ) == ETH_RxDMABurstLength_4xPBL_4Beat ) ||  \
      ( ( LENGTH ) == ETH_RxDMABurstLength_4xPBL_8Beat ) ||  \
      ( ( LENGTH ) == ETH_RxDMABurstLength_4xPBL_16Beat ) || \
      ( ( LENGTH ) == ETH_RxDMABurstLength_4xPBL_32Beat ) || \
      ( ( LENGTH ) == ETH_RxDMABurstLength_4xPBL_64Beat ) || \
      ( ( LENGTH ) == ETH_RxDMABurstLength_4xPBL_128Beat ) )

/* ETHERNET Tx DMA Burst Length ----------------------------------------------*/
#define ETH_TxDMABurstLength_1Beat            ( ( u32 ) 0x00000100 ) /* maximum number of beats to be transferred in one TxDMA (or both) transaction is 1 */
#define ETH_TxDMABurstLength_2Beat            ( ( u32 ) 0x00000200 ) /* maximum number of beats to be transferred in one TxDMA (or both) transaction is 2 */
#define ETH_TxDMABurstLength_4Beat            ( ( u32 ) 0x00000400 ) /* maximum number of beats to be transferred in one TxDMA (or both) transaction is 4 */
#define ETH_TxDMABurstLength_8Beat            ( ( u32 ) 0x00000800 ) /* maximum number of beats to be transferred in one TxDMA (or both) transaction is 8 */
#define ETH_TxDMABurstLength_16Beat           ( ( u32 ) 0x00001000 ) /* maximum number of beats to be transferred in one TxDMA (or both) transaction is 16 */
#define ETH_TxDMABurstLength_32Beat           ( ( u32 ) 0x00002000 ) /* maximum number of beats to be transferred in one TxDMA (or both) transaction is 32 */

#define ETH_TxDMABurstLength_4xPBL_4Beat      ( ( u32 ) 0x01000100 ) /* maximum number of beats to be transferred in one TxDMA (or both) transaction is 4 */
#define ETH_TxDMABurstLength_4xPBL_8Beat      ( ( u32 ) 0x01000200 ) /* maximum number of beats to be transferred in one TxDMA (or both) transaction is 8 */
#define ETH_TxDMABurstLength_4xPBL_16Beat     ( ( u32 ) 0x01000400 ) /* maximum number of beats to be transferred in one TxDMA (or both) transaction is 16 */
#define ETH_TxDMABurstLength_4xPBL_32Beat     ( ( u32 ) 0x01000800 ) /* maximum number of beats to be transferred in one TxDMA (or both) transaction is 32 */
#define ETH_TxDMABurstLength_4xPBL_64Beat     ( ( u32 ) 0x01001000 ) /* maximum number of beats to be transferred in one TxDMA (or both) transaction is 64 */
#define ETH_TxDMABurstLength_4xPBL_128Beat    ( ( u32 ) 0x01002000 ) /* maximum number of beats to be transferred in one TxDMA (or both) transaction is 128 */

#define IS_ETH_TXDMA_BURST_LENGTH( LENGTH )                  \
    ( ( ( LENGTH ) == ETH_TxDMABurstLength_1Beat ) ||        \
      ( ( LENGTH ) == ETH_TxDMABurstLength_2Beat ) ||        \
      ( ( LENGTH ) == ETH_TxDMABurstLength_4Beat ) ||        \
      ( ( LENGTH ) == ETH_TxDMABurstLength_8Beat ) ||        \
      ( ( LENGTH ) == ETH_TxDMABurstLength_16Beat ) ||       \
      ( ( LENGTH ) == ETH_TxDMABurstLength_32Beat ) ||       \
      ( ( LENGTH ) == ETH_TxDMABurstLength_4xPBL_4Beat ) ||  \
      ( ( LENGTH ) == ETH_TxDMABurstLength_4xPBL_8Beat ) ||  \
      ( ( LENGTH ) == ETH_TxDMABurstLength_4xPBL_16Beat ) || \
      ( ( LENGTH ) == ETH_TxDMABurstLength_4xPBL_32Beat ) || \
      ( ( LENGTH ) == ETH_TxDMABurstLength_4xPBL_64Beat ) || \
      ( ( LENGTH ) == ETH_TxDMABurstLength_4xPBL_128Beat ) )

/* ETHERNET DMA Desciptor SkipLength */
#define IS_ETH_DMA_DESC_SKIP_LENGTH( LENGTH )    ( ( LENGTH ) <= 0x1F )

/* ETHERNET DMA Arbitration --------------------------------------------------*/
#define ETH_DMAArbitration_RoundRobin_RxTx_1_1    ( ( u32 ) 0x00000000 )
#define ETH_DMAArbitration_RoundRobin_RxTx_2_1    ( ( u32 ) 0x00004000 )
#define ETH_DMAArbitration_RoundRobin_RxTx_3_1    ( ( u32 ) 0x00008000 )
#define ETH_DMAArbitration_RoundRobin_RxTx_4_1    ( ( u32 ) 0x0000C000 )
#define ETH_DMAArbitration_RxPriorTx              ( ( u32 ) 0x00000002 )

#define IS_ETH_DMA_ARBITRATION_ROUNDROBIN_RXTX( RATIO )          \
    ( ( ( RATIO ) == ETH_DMAArbitration_RoundRobin_RxTx_1_1 ) || \
      ( ( RATIO ) == ETH_DMAArbitration_RoundRobin_RxTx_2_1 ) || \
      ( ( RATIO ) == ETH_DMAArbitration_RoundRobin_RxTx_3_1 ) || \
      ( ( RATIO ) == ETH_DMAArbitration_RoundRobin_RxTx_4_1 ) || \
      ( ( RATIO ) == ETH_DMAArbitration_RxPriorTx ) )

/* ETHERNET DMA Flags ---------------------------------------------------*/
#define ETH_DMA_FLAG_TST                  ( ( u32 ) 0x20000000 ) /* Time-stamp trigger interrupt (on DMA) */
#define ETH_DMA_FLAG_PMT                  ( ( u32 ) 0x10000000 ) /* PMT interrupt (on DMA) */
#define ETH_DMA_FLAG_MMC                  ( ( u32 ) 0x08000000 ) /* MMC interrupt (on DMA) */

