FreeRTOS/FreeRTOS/FreeRTOS/Demo/Common/drivers/ST/STM32F10xFWLib/inc/stm32fxxx_eth.h
#define ETH_DMA_FLAG_DataTransferError    ( ( u32 ) 0x00800000 ) /* Error bits 0-Rx DMA, 1-Tx DMA */
#define ETH_DMA_FLAG_ReadWriteError       ( ( u32 ) 0x01000000 ) /* Error bits 0-write trnsf, 1-read transfr */
#define ETH_DMA_FLAG_AccessError          ( ( u32 ) 0x02000000 ) /* Error bits 0-data buffer, 1-desc. access */
#define ETH_DMA_FLAG_NIS                  ( ( u32 ) 0x00010000 ) /* Normal interrupt summary flag */
#define ETH_DMA_FLAG_AIS                  ( ( u32 ) 0x00008000 ) /* Abnormal interrupt summary flag */
#define ETH_DMA_FLAG_ER                   ( ( u32 ) 0x00004000 ) /* Early receive flag */
#define ETH_DMA_FLAG_FBE                  ( ( u32 ) 0x00002000 ) /* Fatal bus error flag */
#define ETH_DMA_FLAG_ET                   ( ( u32 ) 0x00000400 ) /* Early transmit flag */
#define ETH_DMA_FLAG_RWT                  ( ( u32 ) 0x00000200 ) /* Receive watchdog timeout flag */
#define ETH_DMA_FLAG_RPS                  ( ( u32 ) 0x00000100 ) /* Receive process stopped flag */
#define ETH_DMA_FLAG_RBU                  ( ( u32 ) 0x00000080 ) /* Receive buffer unavailable flag */
#define ETH_DMA_FLAG_R                    ( ( u32 ) 0x00000040 ) /* Receive flag */
#define ETH_DMA_FLAG_TU                   ( ( u32 ) 0x00000020 ) /* Underflow flag */
#define ETH_DMA_FLAG_RO                   ( ( u32 ) 0x00000010 ) /* Overflow flag */
#define ETH_DMA_FLAG_TJT                  ( ( u32 ) 0x00000008 ) /* Transmit jabber timeout flag */
#define ETH_DMA_FLAG_TBU                  ( ( u32 ) 0x00000004 ) /* Transmit buffer unavailable flag */
#define ETH_DMA_FLAG_TPS                  ( ( u32 ) 0x00000002 ) /* Transmit process stopped flag */
#define ETH_DMA_FLAG_T                    ( ( u32 ) 0x00000001 ) /* Transmit flag */

#define IS_ETH_DMA_FLAG( FLAG )    ( ( ( ( FLAG ) &( u32 ) 0xFFFE1800 ) == 0x00 ) && ( ( FLAG ) != 0x00 ) )
#define IS_ETH_DMA_GET_FLAG( FLAG )                                                              \
    ( ( ( FLAG ) == ETH_DMA_FLAG_TST ) || ( ( FLAG ) == ETH_DMA_FLAG_PMT ) ||                    \
      ( ( FLAG ) == ETH_DMA_FLAG_MMC ) || ( ( FLAG ) == ETH_DMA_FLAG_DataTransferError ) ||      \
      ( ( FLAG ) == ETH_DMA_FLAG_ReadWriteError ) || ( ( FLAG ) == ETH_DMA_FLAG_AccessError ) || \
      ( ( FLAG ) == ETH_DMA_FLAG_NIS ) || ( ( FLAG ) == ETH_DMA_FLAG_AIS ) ||                    \
      ( ( FLAG ) == ETH_DMA_FLAG_ER ) || ( ( FLAG ) == ETH_DMA_FLAG_FBE ) ||                     \
      ( ( FLAG ) == ETH_DMA_FLAG_ET ) || ( ( FLAG ) == ETH_DMA_FLAG_RWT ) ||                     \
      ( ( FLAG ) == ETH_DMA_FLAG_RPS ) || ( ( FLAG ) == ETH_DMA_FLAG_RBU ) ||                    \
      ( ( FLAG ) == ETH_DMA_FLAG_R ) || ( ( FLAG ) == ETH_DMA_FLAG_TU ) ||                       \
      ( ( FLAG ) == ETH_DMA_FLAG_RO ) || ( ( FLAG ) == ETH_DMA_FLAG_TJT ) ||                     \
      ( ( FLAG ) == ETH_DMA_FLAG_TBU ) || ( ( FLAG ) == ETH_DMA_FLAG_TPS ) ||                    \
      ( ( FLAG ) == ETH_DMA_FLAG_T ) )

/* ETHERNET DMA Interrupts ---------------------------------------------------*/
#define ETH_DMA_IT_TST    ( ( u32 ) 0x20000000 ) /* Time-stamp trigger interrupt (on DMA) */
#define ETH_DMA_IT_PMT    ( ( u32 ) 0x10000000 ) /* PMT interrupt (on DMA) */
#define ETH_DMA_IT_MMC    ( ( u32 ) 0x08000000 ) /* MMC interrupt (on DMA) */

#define ETH_DMA_IT_NIS    ( ( u32 ) 0x00010000 ) /* Normal interrupt summary */
#define ETH_DMA_IT_AIS    ( ( u32 ) 0x00008000 ) /* Abnormal interrupt summary */
#define ETH_DMA_IT_ER     ( ( u32 ) 0x00004000 ) /* Early receive interrupt */
#define ETH_DMA_IT_FBE    ( ( u32 ) 0x00002000 ) /* Fatal bus error interrupt */
#define ETH_DMA_IT_ET     ( ( u32 ) 0x00000400 ) /* Early transmit interrupt */
#define ETH_DMA_IT_RWT    ( ( u32 ) 0x00000200 ) /* Receive watchdog timeout interrupt */
#define ETH_DMA_IT_RPS    ( ( u32 ) 0x00000100 ) /* Receive process stopped interrupt */
#define ETH_DMA_IT_RBU    ( ( u32 ) 0x00000080 ) /* Receive buffer unavailable interrupt */
#define ETH_DMA_IT_R      ( ( u32 ) 0x00000040 ) /* Receive interrupt */
#define ETH_DMA_IT_TU     ( ( u32 ) 0x00000020 ) /* Underflow interrupt */
#define ETH_DMA_IT_RO     ( ( u32 ) 0x00000010 ) /* Overflow interrupt */
#define ETH_DMA_IT_TJT    ( ( u32 ) 0x00000008 ) /* Transmit jabber timeout interrupt */
#define ETH_DMA_IT_TBU    ( ( u32 ) 0x00000004 ) /* Transmit buffer unavailable interrupt */
#define ETH_DMA_IT_TPS    ( ( u32 ) 0x00000002 ) /* Transmit process stopped interrupt */
#define ETH_DMA_IT_T      ( ( u32 ) 0x00000001 ) /* Transmit interrupt */

#define IS_ETH_DMA_IT( IT )    ( ( ( ( IT ) &( u32 ) 0xFFFE1800 ) == 0x00 ) && ( ( IT ) != 0x00 ) )
#define IS_ETH_DMA_GET_IT( IT )                                       \
    ( ( ( IT ) == ETH_DMA_IT_TST ) || ( ( IT ) == ETH_DMA_IT_PMT ) || \
      ( ( IT ) == ETH_DMA_IT_MMC ) || ( ( IT ) == ETH_DMA_IT_NIS ) || \
      ( ( IT ) == ETH_DMA_IT_AIS ) || ( ( IT ) == ETH_DMA_IT_ER ) ||  \
      ( ( IT ) == ETH_DMA_IT_FBE ) || ( ( IT ) == ETH_DMA_IT_ET ) ||  \
      ( ( IT ) == ETH_DMA_IT_RWT ) || ( ( IT ) == ETH_DMA_IT_RPS ) || \
      ( ( IT ) == ETH_DMA_IT_RBU ) || ( ( IT ) == ETH_DMA_IT_R ) ||   \
      ( ( IT ) == ETH_DMA_IT_TU ) || ( ( IT ) == ETH_DMA_IT_RO ) ||   \
      ( ( IT ) == ETH_DMA_IT_TJT ) || ( ( IT ) == ETH_DMA_IT_TBU ) || \
      ( ( IT ) == ETH_DMA_IT_TPS ) || ( ( IT ) == ETH_DMA_IT_T ) )

/* ETHERNET DMA transmit process state  --------------------------------------------------------*/
#define ETH_DMA_TransmitProcess_Stopped        ( ( u32 ) 0x00000000 ) /* Stopped - Reset or Stop Tx Command issued */
#define ETH_DMA_TransmitProcess_Fetching       ( ( u32 ) 0x00100000 ) /* Running - fetching the Tx descriptor */
#define ETH_DMA_TransmitProcess_Waiting        ( ( u32 ) 0x00200000 ) /* Running - waiting for status */
#define ETH_DMA_TransmitProcess_Reading        ( ( u32 ) 0x00300000 ) /* Running - reading the data from host memory */
#define ETH_DMA_TransmitProcess_Suspended      ( ( u32 ) 0x00600000 ) /* Suspended - Tx Desciptor unavailabe */
#define ETH_DMA_TransmitProcess_Closing        ( ( u32 ) 0x00700000 ) /* Running - closing Rx descriptor */

/* ETHERNET DMA receive process state  --------------------------------------------------------*/
#define ETH_DMA_ReceiveProcess_Stopped         ( ( u32 ) 0x00000000 ) /* Stopped - Reset or Stop Rx Command issued */
#define ETH_DMA_ReceiveProcess_Fetching        ( ( u32 ) 0x00020000 ) /* Running - fetching the Rx descriptor */
#define ETH_DMA_ReceiveProcess_Waiting         ( ( u32 ) 0x00060000 ) /* Running - waiting for packet */
#define ETH_DMA_ReceiveProcess_Suspended       ( ( u32 ) 0x00080000 ) /* Suspended - Rx Desciptor unavailable */
#define ETH_DMA_ReceiveProcess_Closing         ( ( u32 ) 0x000A0000 ) /* Running - closing descriptor */
#define ETH_DMA_ReceiveProcess_Queuing         ( ( u32 ) 0x000E0000 ) /* Running - queuing the recieve frame into host memory */

/* ETHERNET DMA overflow  --------------------------------------------------------*/
#define ETH_DMA_Overflow_RxFIFOCounter         ( ( u32 ) 0x10000000 ) /* Overflow bit for FIFO overflow counter */
#define ETH_DMA_Overflow_MissedFrameCounter    ( ( u32 ) 0x00010000 ) /* Overflow bit for missed frame counter */

