FreeRTOS/FreeRTOS/FreeRTOS/Demo/Common/drivers/ST/STM32F10xFWLib/inc/stm32fxxx_eth.h
#define IS_ETH_DMA_GET_OVERFLOW( OVERFLOW )                 \
    ( ( ( OVERFLOW ) == ETH_DMA_Overflow_RxFIFOCounter ) || \
      ( ( OVERFLOW ) == ETH_DMA_Overflow_MissedFrameCounter ) )

/*----------------------------------------------------------------------------*/
/*                          Ethernet PMT defines                              */
/*----------------------------------------------------------------------------*/
/* ETHERNET PMT Flags --------------------------------------------------------*/
#define ETH_PMT_FLAG_WUFFRPR    ( ( u32 ) 0x80000000 ) /* Wake-Up Frame Filter Register Poniter Reset */
#define ETH_PMT_FLAG_WUFR       ( ( u32 ) 0x00000040 ) /* Wake-Up Frame Received */
#define ETH_PMT_FLAG_MPR        ( ( u32 ) 0x00000020 ) /* Magic Packet Received */

#define IS_ETH_PMT_GET_FLAG( FLAG )        \
    ( ( ( FLAG ) == ETH_PMT_FLAG_WUFR ) || \
      ( ( FLAG ) == ETH_PMT_FLAG_MPR ) )

/*----------------------------------------------------------------------------*/
/*                          Ethernet MMC defines                              */
/*----------------------------------------------------------------------------*/
/* ETHERNET MMC Tx Interrupts */
#define ETH_MMC_IT_TGF       ( ( u32 ) 0x00200000 ) /* When Tx good frame counter reaches half the maximum value */
#define ETH_MMC_IT_TGFMSC    ( ( u32 ) 0x00008000 ) /* When Tx good multi col counter reaches half the maximum value */
#define ETH_MMC_IT_TGFSC     ( ( u32 ) 0x00004000 ) /* When Tx good single col counter reaches half the maximum value */

/* ETHERNET MMC Rx Interrupts */
#define ETH_MMC_IT_RGUF      ( ( u32 ) 0x10020000 ) /* When Rx good unicast frames counter reaches half the maximum value */
#define ETH_MMC_IT_RFAE      ( ( u32 ) 0x10000040 ) /* When Rx alignment error counter reaches half the maximum value */
#define ETH_MMC_IT_RFCE      ( ( u32 ) 0x10000020 ) /* When Rx crc error counter reaches half the maximum value */

#define IS_ETH_MMC_IT( IT )                                                                           \
    ( ( ( ( ( IT ) &( u32 ) 0xFFDF3FFF ) == 0x00 ) || ( ( ( IT ) &( u32 ) 0xEFFDFF9F ) == 0x00 ) ) && \
      ( ( IT ) != 0x00 ) )
#define IS_ETH_MMC_GET_IT( IT )                                          \
    ( ( ( IT ) == ETH_MMC_IT_TGF ) || ( ( IT ) == ETH_MMC_IT_TGFMSC ) || \
      ( ( IT ) == ETH_MMC_IT_TGFSC ) || ( ( IT ) == ETH_MMC_IT_RGUF ) || \
      ( ( IT ) == ETH_MMC_IT_RFAE ) || ( ( IT ) == ETH_MMC_IT_RFCE ) )

/* ETHERNET MMC Registers */
#define ETH_MMCCR          ( ( u32 ) 0x00000100 ) /* MMC CR register */
#define ETH_MMCRIR         ( ( u32 ) 0x00000104 ) /* MMC RIR register */
#define ETH_MMCTIR         ( ( u32 ) 0x00000108 ) /* MMC TIR register */
#define ETH_MMCRIMR        ( ( u32 ) 0x0000010C ) /* MMC RIMR register */
#define ETH_MMCTIMR        ( ( u32 ) 0x00000110 ) /* MMC TIMR register */
#define ETH_MMCTGFSCCR     ( ( u32 ) 0x0000014C ) /* MMC TGFSCCR register */
#define ETH_MMCTGFMSCCR    ( ( u32 ) 0x00000150 ) /* MMC TGFMSCCR register */
#define ETH_MMCTGFCR       ( ( u32 ) 0x00000168 ) /* MMC TGFCR register */
#define ETH_MMCRFCECR      ( ( u32 ) 0x00000194 ) /* MMC RFCECR register */
#define ETH_MMCRFAECR      ( ( u32 ) 0x00000198 ) /* MMC RFAECR register */
#define ETH_MMCRGUFCR      ( ( u32 ) 0x000001C4 ) /* MMC RGUFCR register */

/* ETHERNET MMC registers */
#define IS_ETH_MMC_REGISTER( REG )                                     \
    ( ( ( REG ) == ETH_MMCCR ) || ( ( REG ) == ETH_MMCRIR ) ||         \
      ( ( REG ) == ETH_MMCTIR ) || ( ( REG ) == ETH_MMCRIMR ) ||       \
      ( ( REG ) == ETH_MMCTIMR ) || ( ( REG ) == ETH_MMCTGFSCCR ) ||   \
      ( ( REG ) == ETH_MMCTGFMSCCR ) || ( ( REG ) == ETH_MMCTGFCR ) || \
      ( ( REG ) == ETH_MMCRFCECR ) || ( ( REG ) == ETH_MMCRFAECR ) ||  \
      ( ( REG ) == ETH_MMCRGUFCR ) )

/*----------------------------------------------------------------------------*/
/*                          Ethernet PTP defines                              */
/*----------------------------------------------------------------------------*/
/* ETHERNET PTP time update method -------------------------------------------*/
#define ETH_PTP_FineUpdate      ( ( u32 ) 0x00000001 ) /* Fine Update method */
#define ETH_PTP_CoarseUpdate    ( ( u32 ) 0x00000000 ) /* Coarse Update method */

#define IS_ETH_PTP_UPDATE( UPDATE )           \
    ( ( ( UPDATE ) == ETH_PTP_FineUpdate ) || \
      ( ( UPDATE ) == ETH_PTP_CoarseUpdate ) )

/* ETHERNET PTP Flags --------------------------------------------------------*/
#define ETH_PTP_FLAG_TSARU    ( ( u32 ) 0x00000020 ) /* Addend Register Update */
#define ETH_PTP_FLAG_TSITE    ( ( u32 ) 0x00000010 ) /* Time Stamp Interrupt Trigger */
#define ETH_PTP_FLAG_TSSTU    ( ( u32 ) 0x00000008 ) /* Time Stamp Update */
#define ETH_PTP_FLAG_TSSTI    ( ( u32 ) 0x00000004 ) /* Time Stamp Initialize */

#define IS_ETH_PTP_GET_FLAG( FLAG )         \
    ( ( ( FLAG ) == ETH_PTP_FLAG_TSARU ) || \
      ( ( FLAG ) == ETH_PTP_FLAG_TSITE ) || \
      ( ( FLAG ) == ETH_PTP_FLAG_TSSTU ) || \
      ( ( FLAG ) == ETH_PTP_FLAG_TSSTI ) )

/* ETHERNET PTP subsecond increment */
#define IS_ETH_PTP_SUBSECOND_INCREMENT( SUBSECOND )    ( ( SUBSECOND ) <= 0xFF )

/* ETHERNET PTP time sign ----------------------------------------------------*/
#define ETH_PTP_PositiveTime    ( ( u32 ) 0x00000000 ) /* Positive time value */
#define ETH_PTP_NegativeTime    ( ( u32 ) 0x80000000 ) /* Negative time value */

#define IS_ETH_PTP_TIME_SIGN( SIGN )          \
    ( ( ( SIGN ) == ETH_PTP_PositiveTime ) || \
      ( ( SIGN ) == ETH_PTP_NegativeTime ) )

/* ETHERNET PTP time stamp low update */
#define IS_ETH_PTP_TIME_STAMP_UPDATE_SUBSECOND( SUBSECOND )    ( ( SUBSECOND ) <= 0x7FFFFFFF )

/* ETHERNET PTP registers */
#define ETH_PTPTSCR     ( ( u32 ) 0x00000700 ) /* PTP TSCR register */
#define ETH_PTPSSIR     ( ( u32 ) 0x00000704 ) /* PTP SSIR register */
#define ETH_PTPTSHR     ( ( u32 ) 0x00000708 ) /* PTP TSHR register */
#define ETH_PTPTSLR     ( ( u32 ) 0x0000070C ) /* PTP TSLR register */
#define ETH_PTPTSHUR    ( ( u32 ) 0x00000710 ) /* PTP TSHUR register */
#define ETH_PTPTSLUR    ( ( u32 ) 0x00000714 ) /* PTP TSLUR register */
#define ETH_PTPTSAR     ( ( u32 ) 0x00000718 ) /* PTP TSAR register */
#define ETH_PTPTTHR     ( ( u32 ) 0x0000071C ) /* PTP TTHR register */
#define ETH_PTPTTLR     ( ( u32 ) 0x00000720 ) /* PTP TTLR register */

#define IS_ETH_PTP_REGISTER( REG )                                  \
    ( ( ( REG ) == ETH_PTPTSCR ) || ( ( REG ) == ETH_PTPSSIR ) ||   \
      ( ( REG ) == ETH_PTPTSHR ) || ( ( REG ) == ETH_PTPTSLR ) ||   \
      ( ( REG ) == ETH_PTPTSHUR ) || ( ( REG ) == ETH_PTPTSLUR ) || \
      ( ( REG ) == ETH_PTPTSAR ) || ( ( REG ) == ETH_PTPTTHR ) ||   \
      ( ( REG ) == ETH_PTPTTLR ) )

/* Exported macro ------------------------------------------------------------*/
/* Exported functions ------------------------------------------------------- */
void ETH_DeInit( void );
u32 ETH_Init( ETH_InitTypeDef * ETH_InitStruct,
              u16 PHYAddress );
void ETH_StructInit( ETH_InitTypeDef * ETH_InitStruct );
void ETH_SoftwareReset( void );
FlagStatus ETH_GetSoftwareResetStatus( void );
void ETH_Start( void );
u32 ETH_HandleTxPkt( u32 addr,
                     u16 FrameLength );
u32 ETH_HandleRxPkt( u32 addr );


u32 ETH_GetRxPktSize( void );
void ETH_DropRxPkt( void );

