FreeRTOS/FreeRTOS/FreeRTOS/Demo/Common/drivers/ST/STM32F10xFWLib/inc/stm32fxxx_eth.h
/*---------------------------------  PHY  ------------------------------------*/
u16 ETH_ReadPHYRegister( u16 PHYAddress,
                         u16 PHYReg );
u32 ETH_WritePHYRegister( u16 PHYAddress,
                          u16 PHYReg,
                          u16 PHYValue );
u32 ETH_PHYLoopBackCmd( u16 PHYAddress,
                        FunctionalState NewState );
/*---------------------------------  MAC  ------------------------------------*/
void ETH_MACTransmissionCmd( FunctionalState NewState );
void ETH_MACReceptionCmd( FunctionalState NewState );
FlagStatus ETH_GetFlowControlBusyStatus( void );
void ETH_InitiatePauseControlFrame( void );
void ETH_BackPressureActivationCmd( FunctionalState NewState );
FlagStatus ETH_GetMACFlagStatus( u32 ETH_MAC_FLAG );
ITStatus ETH_GetMACITStatus( u32 ETH_MAC_IT );
void ETH_MACITConfig( u32 ETH_MAC_IT,
                      FunctionalState NewState );
void ETH_MACAddressConfig( u32 MacAddr,
                           u8 * Addr );
void ETH_GetMACAddress( u32 MacAddr,
                        u8 * Addr );
void ETH_MACAddressPerfectFilterCmd( u32 MacAddr,
                                     FunctionalState NewState );
void ETH_MACAddressFilterConfig( u32 MacAddr,
                                 u32 Filter );
void ETH_MACAddressMaskBytesFilterConfig( u32 MacAddr,
                                          u32 MaskByte );
/*-----------------------  DMA Tx/Rx descriptors  ----------------------------*/
void ETH_DMATxDescChainInit( ETH_DMADESCTypeDef * DMATxDescTab,
                             u8 * TxBuff,
                             u32 TxBuffCount );
void ETH_DMATxDescRingInit( ETH_DMADESCTypeDef * DMATxDescTab,
                            u8 * TxBuff1,
                            u8 * TxBuff2,
                            u32 TxBuffCount );
FlagStatus ETH_GetDMATxDescFlagStatus( ETH_DMADESCTypeDef * DMATxDesc,
                                       u32 ETH_DMATxDescFlag );
u32 ETH_GetDMATxDescCollisionCount( ETH_DMADESCTypeDef * DMATxDesc );
void ETH_SetDMATxDescOwnBit( ETH_DMADESCTypeDef * DMATxDesc );
void ETH_DMATxDescTransmitITConfig( ETH_DMADESCTypeDef * DMATxDesc,
                                    FunctionalState NewState );
void ETH_DMATxDescFrameSegmentConfig( ETH_DMADESCTypeDef * DMATxDesc,
                                      u32 DMATxDesc_FrameSegment );
void ETH_DMATxDescChecksumInsertionConfig( ETH_DMADESCTypeDef * DMATxDesc,
                                           u32 DMATxDesc_Checksum );
void ETH_DMATxDescCRCCmd( ETH_DMADESCTypeDef * DMATxDesc,
                          FunctionalState NewState );
void ETH_DMATxDescEndOfRingCmd( ETH_DMADESCTypeDef * DMATxDesc,
                                FunctionalState NewState );
void ETH_DMATxDescSecondAddressChainedCmd( ETH_DMADESCTypeDef * DMATxDesc,
                                           FunctionalState NewState );
void ETH_DMATxDescShortFramePaddingCmd( ETH_DMADESCTypeDef * DMATxDesc,
                                        FunctionalState NewState );
void ETH_DMATxDescTimeStampCmd( ETH_DMADESCTypeDef * DMATxDesc,
                                FunctionalState NewState );
void ETH_DMATxDescBufferSizeConfig( ETH_DMADESCTypeDef * DMATxDesc,
                                    u32 BufferSize1,
                                    u32 BufferSize2 );
void ETH_DMARxDescChainInit( ETH_DMADESCTypeDef * DMARxDescTab,
                             u8 * RxBuff,
                             u32 RxBuffCount );
void ETH_DMARxDescRingInit( ETH_DMADESCTypeDef * DMARxDescTab,
                            u8 * RxBuff1,
                            u8 * RxBuff2,
                            u32 RxBuffCount );
FlagStatus ETH_GetDMARxDescFlagStatus( ETH_DMADESCTypeDef * DMARxDesc,
                                       u32 ETH_DMARxDescFlag );
void ETH_SetDMARxDescOwnBit( ETH_DMADESCTypeDef * DMARxDesc );
u32 ETH_GetDMARxDescFrameLength( ETH_DMADESCTypeDef * DMARxDesc );
void ETH_DMARxDescReceiveITConfig( ETH_DMADESCTypeDef * DMARxDesc,
                                   FunctionalState NewState );
void ETH_DMARxDescEndOfRingCmd( ETH_DMADESCTypeDef * DMARxDesc,
                                FunctionalState NewState );
void ETH_DMARxDescSecondAddressChainedCmd( ETH_DMADESCTypeDef * DMARxDesc,
                                           FunctionalState NewState );
u32 ETH_GetDMARxDescBufferSize( ETH_DMADESCTypeDef * DMARxDesc,
                                u32 DMARxDesc_Buffer );
/*---------------------------------  DMA  ------------------------------------*/
FlagStatus ETH_GetDMAFlagStatus( u32 ETH_DMA_FLAG );
void ETH_DMAClearFlag( u32 ETH_DMA_FLAG );
ITStatus ETH_GetDMAITStatus( u32 ETH_DMA_IT );
void ETH_DMAClearITPendingBit( u32 ETH_DMA_IT );
u32 ETH_GetTransmitProcessState( void );
u32 ETH_GetReceiveProcessState( void );
void ETH_FlushTransmitFIFO( void );
FlagStatus ETH_GetFlushTransmitFIFOStatus( void );
void ETH_DMATransmissionCmd( FunctionalState NewState );
void ETH_DMAReceptionCmd( FunctionalState NewState );
void ETH_DMAITConfig( u32 ETH_DMA_IT,
                      FunctionalState NewState );
FlagStatus ETH_GetDMAOverflowStatus( u32 ETH_DMA_Overflow );
u32 ETH_GetRxOverflowMissedFrameCounter( void );
u32 ETH_GetBufferUnavailableMissedFrameCounter( void );
u32 ETH_GetCurrentTxDescStartAddress( void );
u32 ETH_GetCurrentRxDescStartAddress( void );
u32 ETH_GetCurrentTxBufferAddress( void );
u32 ETH_GetCurrentRxBufferAddress( void );
void ETH_ResumeDMATransmission( void );
void ETH_ResumeDMAReception( void );
/*---------------------------------  PMT  ------------------------------------*/
void ETH_ResetWakeUpFrameFilterRegisterPointer( void );
void ETH_SetWakeUpFrameFilterRegister( u32 * Buffer );
void ETH_GlobalUnicastWakeUpCmd( FunctionalState NewState );
FlagStatus ETH_GetPMTFlagStatus( u32 ETH_PMT_FLAG );
void ETH_WakeUpFrameDetectionCmd( FunctionalState NewState );
void ETH_MagicPacketDetectionCmd( FunctionalState NewState );
void ETH_PowerDownCmd( FunctionalState NewState );
/*---------------------------------  MMC  ------------------------------------*/
void ETH_MMCCounterFreezeCmd( FunctionalState NewState );
void ETH_MMCResetOnReadCmd( FunctionalState NewState );
void ETH_MMCCounterRolloverCmd( FunctionalState NewState );
void ETH_MMCCountersReset( void );
void ETH_MMCITConfig( u32 ETH_MMC_IT,
                      FunctionalState NewState );
ITStatus ETH_GetMMCITStatus( u32 ETH_MMC_IT );
u32 ETH_GetMMCRegister( u32 ETH_MMCReg );
/*---------------------------------  PTP  ------------------------------------*/
u32 ETH_HandlePTPTxPkt( u8 * ppkt,
                        u16 FrameLength,
                        u32 * PTPTxTab );
u32 ETH_HandlePTPRxPkt( u8 * ppkt,
                        u32 * PTPRxTab );
void ETH_DMAPTPTxDescChainInit( ETH_DMADESCTypeDef * DMATxDescTab,
                                ETH_DMADESCTypeDef * DMAPTPTxDescTab,
                                u8 * TxBuff,
                                u32 TxBuffCount );
void ETH_DMAPTPRxDescChainInit( ETH_DMADESCTypeDef * DMARxDescTab,
                                ETH_DMADESCTypeDef * DMAPTPRxDescTab,
                                u8 * RxBuff,
                                u32 RxBuffCount );
void ETH_EnablePTPTimeStampAddend( void );
void ETH_EnablePTPTimeStampInterruptTrigger( void );
void ETH_EnablePTPTimeStampUpdate( void );
void ETH_InitializePTPTimeStamp( void );
void ETH_PTPUpdateMethodConfig( u32 UpdateMethod );
void ETH_PTPTimeStampCmd( FunctionalState NewState );
FlagStatus ETH_GetPTPFlagStatus( u32 ETH_PTP_FLAG );
void ETH_SetPTPSubSecondIncrement( u32 SubSecondValue );
void ETH_SetPTPTimeStampUpdate( u32 Sign,
                                u32 SecondValue,
                                u32 SubSecondValue );
void ETH_SetPTPTimeStampAddend( u32 Value );
void ETH_SetPTPTargetTime( u32 HighValue,
                           u32 LowValue );
u32 ETH_GetPTPRegister( u32 ETH_PTPReg );

#endif /* __STM32FXXX_ETH_H */

/******************* (C) COPYRIGHT 2008 STMicroelectronics *****END OF FILE****/
